       PROCEDURE DIVISION.
           ACCEPT WS-INPUT.
           IF WS-INPUT = 0
           GO TO IS-ZERO
           ELSE
           GO TO END-PROGRAM.
           STOP RUN.
